ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV228/ESP32_WordClockV228.ino
//------------------------------------------------------------------------------              //
// CLOCK initialysations
//--------------------------------------------                                 
static uint32_t msTick;                                                                       // Number of millisecond ticks since we last incremented the second counter
byte      lastminute = 0, lasthour = 0, lastday = 0, sayhour = 0;
bool      Demo                 = false;
bool      FireDisplay          = false;
bool      Zelftest             = false;
bool      Is                   = true;                                                        // Toggle of displaying Is or Was
struct    tm timeinfo;                                                                        // storage of time 
//--------------------------------------------                                                //
// BLE  RX-TX //#include <NimBLEDevice.h>
//--------------------------------------------
static NimBLEServer *pServer      = NULL;
static NimBLECharacteristic * pTxCharacteristic;
static bool BLEConnected    = false;
static bool oldBLEConnected = false;
std::string ReceivedMessageBLE = "";
unsigned long BLEConnectedSince   = 0;
static unsigned long TRConnectedSince = 0;                                                      // Separate timer for TimeReceiver activity (avoid sharing with server timeout)

#define SERVICE_UUID           "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"                         // UART service UUID
#define CHARACTERISTIC_UUID_RX "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"
#define CHARACTERISTIC_UUID_TX "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"

//--------------------------------------------                                                //
// BLE TimeReceiver  //#include <NimBLEDevice.h>
//--------------------------------------------
 #define TIMESENDER_DEVICE_NAME "BLE-UARTtime"
 #define TIMERECEIVER_MIN_RSSI    (-90)

static volatile bool TRneedsCleanup = false;                                    // Set by onDisconnect, handled in loop()

static NimBLEClient*               pClient        = nullptr;
static NimBLERemoteCharacteristic* pRemoteTX      = nullptr;
static NimBLERemoteCharacteristic* pRemoteRX      = nullptr;

// Found address and flags
static NimBLEAddress TRfoundAddr;
static bool          TRhaveFoundAddr      = false;
static bool          TRconnectRequested   = false;
static bool          TRConnecting         = false;
static bool          TRConnected          = false;
static unsigned long TRconnectStartms     = 0;
static unsigned long LastTimeReceiverScan = 0;
static bool          TimeReceiverRunning  = false; 
static const unsigned long CONNECT_TIMEOUT_MS = 10000;                         // 10s

//------------------------------------------------------------------------------              //
// WIFI and webserver
//----------------------------------------
#define NOT_SET       0
#define SET           1
#define SET_AND_OK    2
#define IN_AP_NOT_SET 3
#include "Webpage.h"                                                                          // The Clock web page
#include "SoftAP.h"                                                                           // The web page to enter SSID and password of the WIFI router 
#include "OTAhtml.h"                                                                          // OTA update page
#include "LogViewer.h"                                                                        // Log vieuwer page
#include "ColourPick.h"                                                                       // Colour Picker page
#include "MenuPage.h"                                                                          // Menu page at /menu
WiFiEventId_t wifiEventHandler;                                                               // To stop the interrupts or callbacks triggered by WiFi.onEvent(WiFiEvent);, you need to deregister the event handler.
bool WIFIwasConnected       = false;                                                          // Is WIFI connected?
bool InApMode               = false;
volatile bool ntpJustSynced = false;
const char* AP_SSID         = "StartWordclock";
const char* AP_PASSWORD     = "wordclock";
AsyncWebServer server(80);
DNSServer dnsServer;
bool shouldReboot           = false;
bool OptionYRainbow         = false;
bool DoNotLog               = false;                                                          // Use this flag to suspress Logging to Logviewer 
volatile bool StopTest      = false;                                                          // Set true to interrupt the running LED test
volatile bool LEDtestBusy   = false;                                                          // True while LEDtest() is running
byte NoConnectionCounter    = 0;                                                              // Count times minutes with no WIFI connection
String PendingCommand = "";
//----------------------------------------                                                    //
// WPS
//----------------------------------------
#define ESP_WPS_MODE      WPS_TYPE_PBC
#define ESP_MANUFACTURER  "ESPRESSIF"
#define ESP_MODEL_NUMBER  "ESP32"
#define ESP_MODEL_NAME    "ESPRESSIF IOT"
#define ESP_DEVICE_NAME   "ESP STATION"
static esp_wps_config_t config;

//----------------------------------------                                                    //
// Ring Buffer Logger
// circular Log buffer variables
//----------------------------------------
char*  LogBuffer      = nullptr;                                                              // Circular buffer
size_t LogBufferSize  = 0;                                                                    // Total buffer size
size_t LogWritePos    = 0;                                                                    // Write pointer
size_t LogStartPos    = 0;                                                                    // Startpos Write pointer
bool   LogWrapped     = false;                                                                // Did we wrap?

